## 5.1 Query

In [49]:
from pandas import DataFrame

data = [
    {"cd":"A060310", "nm":"3S", "open":2920, "close":2800},
    {"cd":"A095570", "nm":"AJ네트웍스", "open":1920, "close":1900},
    {"cd":"A006840", "nm":"AK홀딩스", "open":2020, "close":2010},
    {"cd":"A054620", "nm":"APS홀딩스", "open":3120, "close":3200}
]
df = DataFrame(data=data)
df = df.set_index('cd')
df

             nm  open  close
cd
A060310      3S  2920   2800
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [51]:
cond = df['open'] >= 2000
df[cond]

             nm  open  close
cd
A060310      3S  2920   2800
A006840   AK홀딩스  2020   2010
A054620  APS홀딩스  3120   3200

In [50]:
df.query("nm=='3S'")

         nm  open  close
cd
A060310  3S  2920   2800

In [52]:
df.query("open > close")

             nm  open  close
cd
A060310      3S  2920   2800
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010

In [54]:
df.query("open > close")

             nm  open  close
cd
A060310      3S  2920   2800
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010

In [55]:
df.query("nm in ['3S', 'AK홀딩스']")

            nm  open  close
cd
A060310     3S  2920   2800
A006840  AK홀딩스  2020   2010

In [57]:
df.query("cd == 'A060310'")

         nm  open  close
cd
A060310  3S  2920   2800

## 5.2 Filter

In [2]:
from pandas import DataFrame

data = [
    [1416, 1416, 2994, 1755],
    [6.42, 17.63, 21.09, 13.93],
    [1.10, 1.49, 2.06, 1.88]
]

columns = ["2018/12", "2019/12", "2020/12", "2021/12(E)"]
index = ["DPS", "PER", "PBR"]

df = DataFrame(data=data, index=index, columns=columns)
df

     2018/12  2019/12  2020/12  2021/12(E)
DPS  1416.00  1416.00  2994.00     1755.00
PER     6.42    17.63    21.09       13.93
PBR     1.10     1.49     2.06        1.88

In [4]:
df.filter(items=['2018/12'])

Empty DataFrame
Columns: []
Index: [DPS, PER, PBR]

In [10]:
df.filter(items=["PER"], axis=0)

     2018/12  2019/12  2020/12  2021/12(E)
PER     6.42    17.63    21.09       13.93

In [11]:
df.filter(regex="2020")

     2020/12
DPS  2994.00
PER    21.09
PBR     2.06

In [5]:
df.filter(regex="^2020")

     2020/12
DPS  2994.00
PER    21.09
PBR     2.06

In [12]:
df.filter(regex="R$", axis=0)

     2018/12  2019/12  2020/12  2021/12(E)
PER     6.42    17.63    21.09       13.93
PBR     1.10     1.49     2.06        1.88

In [13]:
df.filter(regex="\d{4}")

     2018/12  2019/12  2020/12  2021/12(E)
DPS  1416.00  1416.00  2994.00     1755.00
PER     6.42    17.63    21.09       13.93
PBR     1.10     1.49     2.06        1.88

In [14]:
df.filter(regex="\d{4}/\d{2}$")

     2018/12  2019/12  2020/12
DPS  1416.00  1416.00  2994.00
PER     6.42    17.63    21.09
PBR     1.10     1.49     2.06

## 5.3 정렬 및 순위

In [12]:
from pandas import DataFrame

data = [
    ["037730", "3R", 1510],
    ["036360", "3SOFT", 1790],
    ["005670", "ACTS", 1185]
]

columns = ["종목코드", "종목명", "현재가"]
df = DataFrame(data=data, columns=columns)
df.set_index("종목코드", inplace=True)

In [13]:
df2 = df.sort_values(by="현재가")
df2

          종목명   현재가
종목코드
005670   ACTS  1185
037730     3R  1510
036360  3SOFT  1790

In [7]:
df2 = df.sort_values(by="현재가", ascending=False)
df2

          종목명   현재가
종목코드
036360  3SOFT  1790
037730     3R  1510
005670   ACTS  1185

In [15]:
df['순위'] = df['현재가'].rank()
df

          종목명   현재가   순위
종목코드
037730     3R  1510  2.0
036360  3SOFT  1790  3.0
005670   ACTS  1185  1.0

In [16]:
df = df.sort_values(by="순위")
df

          종목명   현재가   순위
종목코드
005670   ACTS  1185  1.0
037730     3R  1510  2.0
036360  3SOFT  1790  3.0

In [ ]:
from pandas import DataFrame

data = [
    ["037730", "3R", 1510],
    ["036360", "3SOFT", 1790],
    ["005670", "ACTS", 1185]
]

columns = ["종목코드", "종목명", "현재가"]
df = DataFrame(data=data, columns=columns)
df.set_index("종목코드", inplace=True)

In [9]:
df['순위'] = df['현재가'].rank(method='average')
df

          종목명   현재가   순위
종목코드
037730     3R  1510  2.0
036360  3SOFT  1790  3.0
005670   ACTS  1185  1.0

## 5.4 Index 연산

In [16]:
import pandas as pd

idx1 = pd.Index([1, 2, 3])
idx2 = pd.Index([2, 3, 4])
print(type(idx1))

<class 'pandas.core.indexes.numeric.Int64Index'>

In [18]:
idx1.union(idx2)

Int64Index([1, 2, 3, 4], dtype='int64')

In [19]:
idx1.intersection(idx2)

Int64Index([2, 3], dtype='int64')

In [22]:
idx1 - idx2

Int64Index([-1, -1, -1], dtype='int64')

In [20]:
idx1.difference(idx2)

Int64Index([1], dtype='int64')

## 5.6 멀티인덱스

In [21]:
from pandas import DataFrame 
import pandas as pd

data = [
    ['영업이익', '컨센서스', 1000, 1200],
    ['영업이익', '잠정치', 900, 1400],
    ['당기순이익', '컨센서스', 800, 900],
    ['당기순이익', '잠정치', 700, 800],
]

df = DataFrame(data=data)
df = df.set_index( [ 0, 1 ] )
df

               2     3
0     1
영업이익  컨센서스  1000  1200
      잠정치    900  1400
당기순이익 컨센서스   800   900
      잠정치    700   800

In [24]:
df.index.names = ["재무연월", ""]
df.columns = ["2020/06", "2020/09"]
df

            2020/06  2020/09
재무연월
영업이익  컨센서스     1000     1200
      잠정치       900     1400
당기순이익 컨센서스      800      900
      잠정치       700      800

In [25]:
df.loc['영업이익']

      2020/06  2020/09

컨센서스     1000     1200
잠정치       900     1400

In [27]:
df.loc[('영업이익', '컨센서스')]

2020/06    1000
2020/09    1200
Name: (영업이익, 컨센서스), dtype: int64

In [28]:
df.iloc[0]

2020/06    1000
2020/09    1200
Name: (영업이익, 컨센서스), dtype: int64

In [32]:
df.loc[(slice(None), '컨센서스'), :]

            2020/06  2020/09
재무연월
영업이익  컨센서스     1000     1200
당기순이익 컨센서스      800      900

In [33]:
idx = pd.IndexSlice
df.loc[ idx[ : , '컨센서스'], : ]

            2020/06  2020/09
재무연월
영업이익  컨센서스     1000     1200
당기순이익 컨센서스      800      900

## 5.7 멀티컬럼

In [34]:
from pandas import DataFrame 

data = [
    [1000, 900, 800, 700],
    [1200, 1400, 900, 800],    
]

columns = [
    ['영업이익', '영업이익', '당기순이익', '당기순이익'],
    ['컨센서스', '잠정치', '컨센서스', '잠정치']
]

df = DataFrame(data=data, index=["2020/06", "2020/09"], columns=columns)
df

         영업이익       당기순이익
         컨센서스   잠정치  컨센서스  잠정치
2020/06  1000   900   800  700
2020/09  1200  1400   900  800

In [35]:
import pandas as pd

level_0 = ['영업이익', '당기순이익']
level_1 = ['컨센서스', '잠정치']

idx = pd.MultiIndex.from_product( [level_0, level_1] )

print(idx)
print(idx.get_level_values(0))

MultiIndex([( '영업이익', '컨센서스'),
            ( '영업이익',  '잠정치'),
            ('당기순이익', '컨센서스'),
            ('당기순이익',  '잠정치')],
           )
Index(['영업이익', '영업이익', '당기순이익', '당기순이익'], dtype='object')

In [36]:
level_0 = ['영업이익', '당기순이익']
level_1 = ['컨센서스', '잠정치']
columns = pd.MultiIndex.from_product( [level_0, level_1] )
df = DataFrame(data=data, index=["2020/06", "2020/09"], columns=columns)
df

         영업이익       당기순이익
         컨센서스   잠정치  컨센서스  잠정치
2020/06  1000   900   800  700
2020/09  1200  1400   900  800

In [37]:
df['영업이익']

         컨센서스   잠정치
2020/06  1000   900
2020/09  1200  1400

In [38]:
df[('영업이익', '컨센서스')]

2020/06    1000
2020/09    1200
Name: (영업이익, 컨센서스), dtype: int64

In [39]:
print(df[ '영업이익' ])                            # 전체 영업이익 선택
print(df.loc[ '2020/06', '영업이익' ])                # 2020/06의 영업이익 선택
print(df.loc[ '2020/06', ( '영업이익', '컨센서스' ) ])   # 2020/06의 영업이익의 컨센서스 선택
print(df.loc[ '2020/06', ( slice(None), '컨센서스' ) ])  # 2020/06의 모든 컨센서스 선택

         컨센서스   잠정치
2020/06  1000   900
2020/09  1200  1400
컨센서스    1000
잠정치      900
Name: 2020/06, dtype: int64
1000
영업이익   컨센서스    1000
당기순이익  컨센서스     800
Name: 2020/06, dtype: int64

In [41]:
df.transpose()

            2020/06  2020/09
영업이익  컨센서스     1000     1200
      잠정치       900     1400
당기순이익 컨센서스      800      900
      잠정치       700      800

In [42]:
df.T

            2020/06  2020/09
영업이익  컨센서스     1000     1200
      잠정치       900     1400
당기순이익 컨센서스      800      900
      잠정치       700      800